MikroElektronika/core_packages/ARM/gcc_clang/system/src/nxp/kw45z/thirdparty/kw45z/periph/PERI_RFMC.h
/*
** ###################################################################
**     Processors:          KW45B41Z52AFPA
**                          KW45B41Z52AFTA
**                          KW45B41Z53AFPA
**                          KW45B41Z53AFTA
**                          KW45B41Z82AFPA
**                          KW45B41Z82AFTA
**                          KW45B41Z83AFPA
**                          KW45B41Z83AFPA_NBU
**                          KW45B41Z83AFTA
**                          KW45B41Z83AFTA_NBU
**                          KW45Z41052AFPA
**                          KW45Z41052AFTA
**                          KW45Z41053AFPA
**                          KW45Z41053AFTA
**                          KW45Z41082AFPA
**                          KW45Z41082AFTA
**                          KW45Z41083AFPA
**                          KW45Z41083AFTA
**
**     Version:             rev. 1.0, 2020-05-12
**     Build:               b240715
**
**     Abstract:
**         CMSIS Peripheral Access Layer for RFMC
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2024 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2020-05-12)
**         Initial version.
**
** ###################################################################
*/

/*!
 * @file RFMC.h
 * @version 1.0
 * @2025-05-16 2020-05-12
 * @brief CMSIS Peripheral Access Layer for RFMC
 *
 * CMSIS Peripheral Access Layer for RFMC
 */

#if !defined(RFMC_H_)
#define RFMC_H_                                  /**< Symbol preventing repeated inclusion */

#if (defined(CPU_KW45B41Z52AFPA) || defined(CPU_KW45B41Z52AFTA))
#include "KW45B41Z52_COMMON.h"
#elif (defined(CPU_KW45B41Z53AFPA) || defined(CPU_KW45B41Z53AFTA))
#include "KW45B41Z53_COMMON.h"
#elif (defined(CPU_KW45B41Z82AFPA) || defined(CPU_KW45B41Z82AFTA))
#include "KW45B41Z82_COMMON.h"
#elif (defined(CPU_KW45B41Z83AFPA) || defined(CPU_KW45B41Z83AFTA))
#include "KW45B41Z83_COMMON.h"
#elif (defined(CPU_KW45B41Z83AFPA_NBU) || defined(CPU_KW45B41Z83AFTA_NBU))
#include "KW45B41Z83_NBU_COMMON.h"
#elif (defined(CPU_KW45Z41052AFPA) || defined(CPU_KW45Z41052AFTA))
#include "KW45Z41052_COMMON.h"
#elif (defined(CPU_KW45Z41053AFPA) || defined(CPU_KW45Z41053AFTA))
#include "KW45Z41053_COMMON.h"
#elif (defined(CPU_KW45Z41082AFPA) || defined(CPU_KW45Z41082AFTA))
#include "KW45Z41082_COMMON.h"
#elif (defined(CPU_KW45Z41083AFPA) || defined(CPU_KW45Z41083AFTA))
#include "KW45Z41083_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- RFMC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RFMC_Peripheral_Access_Layer RFMC Peripheral Access Layer
 * @{
 */

/** RFMC - Register Layout Typedef */
typedef struct {
  __I  uint32_t VERID;                             /**< RFMC Version ID Register, offset: 0x0 */
  __I  uint32_t PARAM;                             /**< RFMC Parameter Register, offset: 0x4 */
  __IO uint32_t CTRL;                              /**< RFMC Control Register, offset: 0x8 */
  __IO uint32_t XO_CTRL;                           /**< XO Control Register, offset: 0xC */
  __IO uint32_t XO_STAT;                           /**< XO Status Register, offset: 0x10 */
  __IO uint32_t XO_TEST;                           /**< XO Test Register, offset: 0x14 */
  __IO uint32_t RF2P4GHZ_CTRL;                     /**< 2.4GHz Radio Control Register, offset: 0x18 */
  __IO uint32_t RF2P4GHZ_STAT;                     /**< 2.4GHz Radio Status Register, offset: 0x1C */
  __IO uint32_t RF2P4GHZ_COEXT;                    /**< 2.4GHz Radio Coexistence Register, offset: 0x20 */
  __IO uint32_t RF2P4GHZ_TIMER;                    /**< 2.4GHz TIMER Register, offset: 0x24 */
  __I  uint32_t RF2P4GHZ_WOR1;                     /**< 2.4GHz WOR Register 1, offset: 0x28 */
  __IO uint32_t RF2P4GHZ_WOR2;                     /**< 2.4GHz WOR Register 2, offset: 0x2C */
  __I  uint32_t RF2P4GHZ_MAN1;                     /**< 2.4GHz MAN Register 1, offset: 0x30 */
  __IO uint32_t RF2P4GHZ_MAN2;                     /**< 2.4GHz MAN Register 2, offset: 0x34 */
  __I  uint32_t RF2P4GHZ_MAN3;                     /**< 2.4GHz MAN Register 3, offset: 0x38 */
  __I  uint32_t RF2P4GHZ_MAN4;                     /**< 2.4GHz MAN Register 4, offset: 0x3C */
} RFMC_Type;

/* ----------------------------------------------------------------------------
   -- RFMC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RFMC_Register_Masks RFMC Register Masks
 * @{
 */

/*! @name VERID - RFMC Version ID Register */
/*! @{ */

#define RFMC_VERID_RADIO_ID_MASK                 (0xFFFFU)
#define RFMC_VERID_RADIO_ID_SHIFT                (0U)
/*! RADIO_ID - Radio Identification Number */
#define RFMC_VERID_RADIO_ID(x)                   (((uint32_t)(((uint32_t)(x)) << RFMC_VERID_RADIO_ID_SHIFT)) & RFMC_VERID_RADIO_ID_MASK)

#define RFMC_VERID_MINOR_MASK                    (0xFF0000U)
#define RFMC_VERID_MINOR_SHIFT                   (16U)
/*! MINOR - Minor RFMC Version Number */
#define RFMC_VERID_MINOR(x)                      (((uint32_t)(((uint32_t)(x)) << RFMC_VERID_MINOR_SHIFT)) & RFMC_VERID_MINOR_MASK)

#define RFMC_VERID_MAJOR_MASK                    (0xFF000000U)
#define RFMC_VERID_MAJOR_SHIFT                   (24U)
/*! MAJOR - Major RFMC Version Number */
#define RFMC_VERID_MAJOR(x)                      (((uint32_t)(((uint32_t)(x)) << RFMC_VERID_MAJOR_SHIFT)) & RFMC_VERID_MAJOR_MASK)
/*! @} */

